* TODO Try with cabal instead of stack

- [X] Create (Nix) (dir)env with cabal + ghc in it that works
  + I want to try building with pkgsStatic, so I need a Nix expression
  + Otherwise, cabal is fine
- [ ] Pin dependencies appropriately
- [ ] Build with Nix
- [ ] Build statically with Nix
* TODO Create/Edit/Delete new exercises in UI
* TODO Synchronize other way into webdav
* TODO Specify muscle groups with percentage
* TODO Redo "Human" without head this time
* TODO Concept for running/endurance/power
* TODO Have a history of exercises
* TODO Rank exercises by how many other exercises have this muscle group
* DONE Add badges
CLOSED: [2022-07-23 Sa 14:35]
* DONE Fix scolling behavior
CLOSED: [2022-07-23 Sa 14:29]
:LOGBOOK:
CLOCK: [2022-07-23 Sa 12:11]--[2022-07-23 Sa 14:29] =>  2:18
:END:

- [X] We can scroll +1 last
- [X] Header line isn't sticky
* DONE Add GitHub actions
CLOSED: [2022-07-23 Sa 12:10]
:LOGBOOK:
CLOCK: [2022-07-23 Sa 12:10]--[2022-07-23 Sa 12:10] =>  0:00
:END:
* DONE Fix "tag first exercise" bug
CLOSED: [2022-07-23 Sa 11:54]

- How do we reproduce this even?
- Start, go 4 down, press 't', element prior to last will be selected
* DONE Remove "categories" notion (for now)
CLOSED: [2022-07-23 Sa 11:42]
:LOGBOOK:
CLOCK: [2022-07-23 Sa 11:40]--[2022-07-23 Sa 11:42] =>  0:02
:END:
* CANCELLED Modify ranking to promote "singular" exercises
CLOSED: [2022-07-23 Sa 11:40]
* DONE Formally describe algorithm
CLOSED: [2022-07-22 Fr 11:50]
* DONE Fix error with stack/ghc/ghcide mismatch
CLOSED: [2022-07-21 Do 11:29]

- Seems hls was built with ghc-9.2.2, but I'm using 9.0.2 for my project.
  #+begin_example
[stderr] Run entered for haskell-language-server-wrapper(haskell-language-server-wrapper) Version 1.7.0.0 x86_64 ghc-9.2.2
  #+end_example
- Later on:
  #+begin_example
[stderr] Consulting the cradle to get project GHC version...
[stderr] Project GHC version: 9.0.2
[stderr] Project GHC version: 9.0.2
[stderr] haskell-language-server exe candidates: ["haskell-language-server-9.0.2","haskell-language-server"]
  #+end_example
- Then:
  #+begin_example
[stderr] 2022-07-16 08:13:36.889435817 [ThreadId 1160] INFO hie-bios:	    Could not load module ‘Prelude’
[stderr] 2022-07-16 08:13:36.88945312 [ThreadId 1160] INFO hie-bios:	    It is a member of the hidden package ‘base-4.15.1.0’.
  #+end_example
- The library builds fine - the tests don't.
* DONE Figure out how to pass modified exercises to different views
CLOSED: [2022-07-21 Do 12:36]
:LOGBOOK:
CLOCK: [2022-07-21 Do 12:30]--[2022-07-21 Do 12:36] =>  0:06
:END:
* DONE Remove brick-specifics from =Myocardio=
CLOSED: [2022-07-21 Do 12:30]
* DONE Show tab bar for the two pages (so far)
CLOSED: [2022-07-21 Do 12:12]
:LOGBOOK:
CLOCK: [2022-07-21 Do 11:42]--[2022-07-21 Do 12:12] =>  0:30
:END:
* DONE Expand footer in Main Page
CLOSED: [2022-07-21 Do 11:42]
:LOGBOOK:
CLOCK: [2022-07-21 Do 11:30]--[2022-07-21 Do 11:42] =>  0:12
:END:
* DONE Display muscle groups that need more training [4/4]
CLOSED: [2022-07-21 Do 13:28]
** DONE Headlines for front/back
CLOSED: [2022-07-03 So 12:30]
:LOGBOOK:
CLOCK: [2022-07-03 So 11:57]--[2022-07-03 So 12:30] =>  0:33
:END:
** DONE Show list of muscle groups next to that
CLOSED: [2022-07-03 So 14:10]
:LOGBOOK:
CLOCK: [2022-07-03 So 12:37]--[2022-07-03 So 12:40] =>  0:03
CLOCK: [2022-07-03 So 12:30]--[2022-07-03 So 12:32] =>  0:02
:END:
** DONE Use separate tab and display both
CLOSED: [2022-07-21 Do 12:36]
** DONE Use actual muscle values for image
CLOSED: [2022-07-21 Do 13:28]
* DONE Synchronize config file via webdav, for example?
CLOSED: [2022-07-21 Do 17:09]
:LOGBOOK:
CLOCK: [2022-07-21 Do 16:04]--[2022-07-21 Do 17:09] =>  1:05
CLOCK: [2022-07-21 Do 13:38]--[2022-07-21 Do 14:21] =>  0:43
CLOCK: [2022-07-21 Do 13:32]--[2022-07-21 Do 13:38] =>  0:06
:END:

- Should be no problem:
  + create a new tls manager like so: https://www.stackage.org/package/http-client-tls
  + Execute a MKCOL/PUT like so: https://stackoverflow.com/questions/1205101/command-line-utility-for-webdav-upload
* DONE Properly separate lib/app
CLOSED: [2022-07-21 Do 12:37]
* DONE Fix cabal warnings
CLOSED: [2022-07-03 So 11:57]
:LOGBOOK:
CLOCK: [2022-07-03 So 11:51]--[2022-07-03 So 11:57] =>  0:06
:END:
* DONE Fix hie to use lib/test/main
CLOSED: [2022-07-03 So 12:36]
:LOGBOOK:
CLOCK: [2022-07-03 So 12:32]--[2022-07-03 So 12:36] =>  0:04
:END:
* DONE Specify muscle groups in enum
CLOSED: [2022-07-03 So 13:05]
:LOGBOOK:
CLOCK: [2022-07-03 So 12:40]--[2022-07-03 So 13:05] =>  0:25
:END:
